{
  "title": "Codeforces Heuristic Contest 001",
  "slug": "cf-2195-H",
  "difficulty": "Easy",
  "tags": [
    "brute force",
    "constructive algorithms",
    "geometry",
    "implementation"
  ],
  "time_limit_ms": 2000,
  "memory_limit_kb": 256000,
  "description": "There is a grid of 3ğ‘›Ã—3ğ‘›3 ğ‘›Ã—3 ğ‘› points, consisting of all integer points (ğ‘¥,ğ‘¦)\n such that 1â‰¤ğ‘¥,ğ‘¦â‰¤3ğ‘›1â‰¤ğ‘¥,ğ‘¦â‰¤3 ğ‘›.\n\nFind a largest set of triangles satisfying the following conditions:\n\nEach triangle has its vertices on exactly three points on the grid.\nEach triangle has an area of exactly 1^2. Note that they do not have to be right triangles.\nNo two triangles share a common intersection point, including their vertices.\n\nIf there exist multiple largest such sets of triangles, you may output any of them.",
  "input_format": "Each test contains multiple test cases. The first line contains the number of test cases ğ‘¡ (1â‰¤ğ‘¡â‰¤30). The description of the test cases follows.\n\nThe only line of each test case contains a single integer ğ‘› (1â‰¤ğ‘›â‰¤166).\n\nIt is guaranteed that the sum of ğ‘›2 over all test cases does not exceed 166^2.",
  "output_format": "Output the maximum size ğ‘š of the set of triangles on one line (0â‰¤ğ‘šâ‰¤3 ğ‘›20â‰¤ğ‘šâ‰¤3 ğ‘›2).\n\nThen, output ğ‘š lines in the following format:\n\nğ‘¥ğ‘–,1 ğ‘¦ğ‘–,1 ğ‘¥ğ‘–,2 ğ‘¦ğ‘–,2 ğ‘¥ğ‘–,3 ğ‘¦ğ‘–,3 ğ‘¥ğ‘–,1 ğ‘¦ğ‘–,1 ğ‘¥ğ‘–,2 ğ‘¦ğ‘–,2 ğ‘¥ğ‘–,3 ğ‘¦ğ‘–,3\n: The vertices of the ğ‘–-th triangle are (ğ‘¥ğ‘–,1,ğ‘¦ğ‘–,1)\n, (ğ‘¥ğ‘–,2,ğ‘¦ğ‘–,2)\n, (ğ‘¥ğ‘–,3,ğ‘¦ğ‘–,3)\n.\n\nYou may output the vertices of one triangle in any order (clockwise or counterclockwise).\n\nYour output will be accepted if it satisfies all conditions and the maximum size given is correct.",
  "constraints": "In the first test case, the example output has 2 triangles as shown in the following image:\n\nIn the second test case, the example output has 12 triangles as shown in the image on the left:\n\n\t\n\nAs the triangles are not required to be right triangles, the set of triangles shown in the image on the right will also be considered valid.",
  "test_cases": [
    {
      "input": "2\n1\n2",
      "output": "2\n1 1 1 2 2 1\n2 3 3 2 3 3\n12\n1 1 1 2 2 1\n2 2 3 2 3 1\n1 3 1 4 2 3\n2 4 3 4 3 3\n1 5 1 6 2 5\n2 6 3 6 3 5\n4 1 4 2 5 1\n5 2 6 2 6 1\n4 3 4 4 5 3\n5 4 6 4 6 3\n4 5 4 6 5 5\n5 6 6 6 6 5",
      "is_sample": true
    }
  ],
  "patterns": [
    "backtracking",
    "brute-force",
    "greedy"
  ]
}